OpenFOAM/OpenFOAM-2.2.x/tutorials/multiphase/interPhaseChangeDyMFoam/propeller/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Do a synchronisation of coupled points after creation of any patches.
// Note: this does not work with points that are on multiple coupled patches
//       with transformations (i.e. cyclics).
pointSync false;

// Patches to create.
patches
(
    {
        name inlet;

        patchInfo
        {
            type            patch;
        }

        constructFrom set;

        set inletFaces;
    }
    {
        name outlet;

        patchInfo
        {
            type            patch;
        }

        constructFrom set;

        set outletFaces;
    }
);

// ************************************************************************* //
